Documents/ЗаявкаНаВыплатуРасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВыплатуРасхода</Name>
			<BasedOn>
				<xr:Item>Document.РасходПоЗадачеПроекта</xr:Item>
				<xr:Item>Document.РасходПоЗадачеПроизводство</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасходПоЗадаче</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходПоЗадачеПроизводство</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходПоЗадачеПроекта</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаВыплатуРасхода/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьОстатокПоСтатье( ЗаявкаНаВыплату, Статья, РКО )
	Возврат Документы.ЗаявкаНаВыплатуРасхода.ПолучитьОстатокПоСтатьеРасхода( ЗаявкаНаВыплату, Статья, РКО );
КонецФункции


&НаКлиенте
Процедура УстановитьОстатокПоСтатье()
	//ОстатокПоСтатье = ПолучитьОстатокПоСтатье( Объект.Ссылка, Объект.Статья, Объект.РКО );
КонецПроцедуры



&НаСервереБезКонтекста
Функция мСтатьи( РасходПоЗадаче )
	Если НЕ ЗначениеЗаполнено( РасходПоЗадаче ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	//
	мС = Новый Массив;
	Для Каждого Стр ИЗ РасходПоЗадаче.Описание Цикл
		Если мС.Найти( Стр.Статья ) = Неопределено Тогда
			мС.Добавить( Стр.Статья );
		КонецЕсли;
	КонецЦикла;
    Возврат мС;
КонецФункции


&НаКлиенте
Процедура СтатьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//мС = мСтатьи( Объект.РасходПоЗадаче );
	//Если мС = Неопределено Тогда
	//ИначеЕсли мС.Количество()  <>   0 Тогда
	//	ЭтаФорма.Элементы.Статья.РежимВыбораИзСписка=Истина;
	//	ЭтаФорма.Элементы.Статья.СписокВыбора.ЗагрузитьЗначения( мС );
	//Иначе
	//	СтандартнаяОбработка = Ложь;
	//КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РКОПриИзменении(Элемент)
	УстановитьОстатокПоСтатье();
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	УстановитьОстатокПоСтатье();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОстатокПоСтатье();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОстатокПоСтатье();
КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	Если НЕ РазрешеноСоздаватьДокумент( Объект.Ссылка, Объект.РасходПоЗадаче.ЗадачаПроекта.Владелец ) Тогда
//		Сообщить("Документ создается только на основании проекта в статусе 'В работе !");
//		Отказ = Истина;
//		Возврат;
//	КонецЕсли;		
//	//Вставить содержимое обработчика
//КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
	//И НЕ РазрешеноПроводитьДокумент( ТекущийОбъект.Ссылка, ТекущийОбъект.РасходПоЗадаче.ЗадачаПроекта.Владелец  ) Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если  НЕ ЗначениеЗаполнено( Объект.ПериодРегистрации ) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	//Изменено Гумединым А.Г. 17:41 30.03.2018 по задаче #128854
	//Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
КонецПроцедуры
